app/controllers/students_controller.rb

    def create
      student = Student.create(params[:student])
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-12-01 17:13:07.770773"], ["updated_at", "2018-12-01 17:13:07.770773"]]

    def update
      @student = Student.find(params[:id])

      @student.update(params[:student])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-12-01 17:22:45.929915"], ["id", 1]]